---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralF
enum: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape
source: html/8130cd51-a81f-c359-9fd4-789590b07034.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralF

Defines parameters for Flat Bar structural sections.